#include "delay.h"
#include "sys.h"
#include "lcd.h"
#include "touch.h"
#include "gui.h"
#include "test.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//测试硬件：单片机STM32F103,主频72M  单片机工作电压3.3V
//mcudev TFT1.44液晶驱动 for STM32 IO模拟
//创建日期:2013/5/13
//版本：V1.1
//版权所有，盗版必究。
//////////////////////////////////////////////////////////////////////////////////	
/****************************************************************************************************
//=======================================液晶屏数据线接线==========================================//
//CS		接PB12	//片选信号
//CLK	    接PB13	//SPI时钟信号
//SDI(DIN)	接PB15	//SPI总线数据信号
//=======================================液晶屏控制线接线==========================================//
//RS(D/C)   接PB1	//寄存器/数据选择信号(RS=0数据总线发送的是指令；RS=1数据总线发送的是像素数据)
//RST	      接系统复位NRST	//液晶屏复位信号，低电平复位
/////////////////////////////////////////////////////////////////////////////////////////////////
//==================================如何精简到只需要3个IO=======================================//
//1.CS信号可以精简，不作SPI复用片选可将CS接地常低，节省1个IO
//2.LED背光控制信号可以接高电平3.3V背光常亮，节省1个IO
//3.RST复位信号可以接到单片机的复位端，利用系统上电复位，节省1个IO
//==================================如何切换横竖屏显示=======================================//
//打开lcd.h头文件，修改宏#define USE_HORIZONTAL 值为0使用竖屏模式.1,使用横屏模式
//===========================如何切换模拟SPI总线驱动和硬件SPI总线驱动=========================//
//打开lcd.h头文件，修改宏#define USE_HARDWARE_SPI  值为0使用模拟SPI总线.1,使用硬件SPI总线
**************************************************************************************************/	

int main(void)
{//	u16 i=0;	
	SystemInit();        //初始化RCC 设置系统主频为72MHZ
	delay_init(72);	     //延时初始化
	LCD_Init();	         //液晶屏初始化
	LCD_Clear(BLACK);    //清屏
	gui_circle(128/2,128/2,WHITE,128/2-2, 0); //画圆
	gui_circle(128/2,128/2,WHITE,128/2-3, 0);//画圆

	Gui_StrCenter(0,10,BLUE,YELLOW,"Mcudev",16,1);//居中显示
	Gui_StrCenter(0,28,RED,BLUE,"Temp:32℃",16,1);//居中显示
	Gui_StrCenter(0,46,YELLOW,BLUE,"Hum:20%",16,1);//居中显示
	Gui_StrCenter(0,64,WHITE,BLUE,"VOL:3.2V",16,1);//居中显示
	Gui_StrCenter(0,82,GREEN,BLUE,"I:1.25mA",16,1);//居中显示
	Gui_StrCenter(0,100,RED,BLUE,"12:20AM",16,1);//居中显示
	while(1);
			  	
}

